DataProcessors/ДатаМарк.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ДатаМарк</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоединениеССервером</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТестовыйКОнтур</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийКонтур</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТестовыйРабочий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечныйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ДатаМарк/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	//ЛогаутНаСервере(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Логин(Команда)
	Если Объект.ТестовыйРабочий = 1 Тогда
		СсылкаСервера = Объект.ТестовыйКонтур;
	Иначе
	    СсылкаСервера = Объект.РабочийКонтур;
	КонецЕсли;
	ЛогинНаСервере(СсылкаСервера, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ЛогинНаСервере(СсылкаСервера, Объект)
	//Логин
	Разделитель = ";";
	Соединение = Новый HTTPСоединение(СсылкаСервера,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; boundary="+Разделитель);
	Запрос = Новый HTTPЗапрос("/auth", Заголовки);
	Запрос.УстановитьТелоИзСтроки("username="+Константы.ЛогинДатаМарк.Получить()+"&password="+Константы.ПарольДатаМарк.Получить());
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	ДанныеПользователя = ПрочитатьJSON(ЧтениеJSON, Ложь);
	//Конец логина
	
	
	//Пробная секция
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Заголовки.Вставить("Host", СсылкаСервера);
	Заголовки.Вставить("Token", ДанныеПользователя.Token);
	Запрос = Новый HTTPЗапрос("/v2/reports/addUsed", Заголовки);
	
	НачальныйНомер = Объект.НачальныйНомер;
	КонечныйНомер = Объект.КонечныйНомер;
	МассивУКЗ = Новый Массив;
	Пока НачальныйНомер <= КонечныйНомер Цикл
		МассивУКЗ.Добавить(Объект.Серия+СтрЗаменить(Строка(НачальныйНомер)," ", ""));  //"AAA63 997 835"
		НачальныйНомер = НачальныйНомер+1;
	КонецЦикла;
	СтруктураПараметровJSON = Новый Структура;
	СтруктураПараметровJSON.Вставить("group", "ukz");
	СтруктураПараметровJSON.Вставить("item", "100900000695405");
	СтруктураПараметровJSON.Вставить("labels", МассивУКЗ);

	ВремменныйФайлДляJSON = ПолучитьИмяВременногоФайла("txt");
	ТелоЗапроса = Новый ЗаписьJSON;
	ТелоЗапроса.ОткрытьФайл(ВремменныйФайлДляJSON);
	ЗаписатьJSON(ТелоЗапроса, СтруктураПараметровJSON);
	ТелоЗапроса.Закрыть();
	
	Запрос.УстановитьИмяФайлаТела(ВремменныйФайлДляJSON);
	ОтветВыхода = Соединение.ОтправитьДляОбработки(Запрос);
	
	ааа = 1;
	//Конец пробной секции
		
	

	
	
	
	//Логаут
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Заголовки.Вставить("Host", СсылкаСервера);
	Заголовки.Вставить("Token", ДанныеПользователя.Token);
	Запрос = Новый HTTPЗапрос("/logout", Заголовки);
	ОтветВыхода = Соединение.ОтправитьДляОбработки(Запрос);
	//Конец логаута
КонецПроцедуры

&НаСервере
Процедура ЛогаутНаСервере(Объект)
	
	//Заголовки = Новый Соответствие;
	//Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	//Заголовки.Вставить("Host", Константы.АдресДатаМарк.Получить());
	//Заголовки.Вставить("Token", Объект.Токен);
	//Запрос = Новый HTTPЗапрос("/logout", Заголовки);
	//ОтветВыхода = Соединение.ОтправитьДляОбработки(Запрос);

КонецПроцедуры

&НаКлиенте
Процедура Логаут(Команда)
	
	//ЛогаутНаСервере(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ТестовыйКОнтур = "v2-sandbox-api.datamark.by";
	Объект.РабочийКонтур = "api.datamark.by";
	Объект.ТестовыйРабочий = 1;
	Объект.Серия = "AAA";
	Объект.НачальныйНомер = 63997831;
	Объект.КонечныйНомер = 63997841;
КонецПроцедуры


	//Получение списка категорий
	//Заголовки = Новый Соответствие;
	//Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	//Заголовки.Вставить("Host", СсылкаСервера);
	//Заголовки.Вставить("Token", ДанныеПользователя.Token);
	//Запрос = Новый HTTPЗапрос("/catalogs/", Заголовки);
	//ОтветВыхода = Соединение.ОтправитьДляОбработки(Запрос);


	//Проба добавления по GTIN - нихуя не вышло, закрыт доступ
	//Заголовки = Новый Соответствие;
	//Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	//Заголовки.Вставить("Host", СсылкаСервера);
	//Заголовки.Вставить("Token", ДанныеПользователя.Token);
	//Запрос = Новый HTTPЗапрос("/items/addByGtin", Заголовки);
	//Запрос.УстановитьТелоИзСтроки("gtin="+СтрЗаменить(Строка(Объект.Товар.GTIN), " ", ""));
	//ОтветВыхода = Соединение.ОтправитьДляОбработки(Запрос);

	
	//Проба добавления группы
	//Заголовки = Новый Соответствие;
	//Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	//Заголовки.Вставить("Host", СсылкаСервера);
	//Заголовки.Вставить("Token", ДанныеПользователя.Token);
	//Запрос = Новый HTTPЗапрос("/v2/reports/addMark", Заголовки);
	//ОтветВыхода = Соединение.ОтправитьДляОбработки(Запрос);

	
	//Проба отправки отчета по УКЗ
	//Заголовки = Новый Соответствие;
	//Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	//Заголовки.Вставить("Host", СсылкаСервера);
	//Заголовки.Вставить("Token", ДанныеПользователя.Token);
	//Запрос = Новый HTTPЗапрос("/v2/reports/addMark", Заголовки);
	//ИмяФайлаСпискаУКЗ = ПолучитьИмяВременногоФайла("txt");
	//ПереченьУКЗ = Новый ТекстовыйДокумент;
	//ПереченьУКЗ.ДобавитьСтроку("{");
	//ПереченьУКЗ.ДобавитьСтроку("""group"": ""ukz"",");
	//ПереченьУКЗ.ДобавитьСтроку("""labels"": [");
	//НачальныйНомер = Объект.НачальныйНомер;
	//КонечныйНомер = Объект.КонечныйНомер;
	//Пока НачальныйНомер <= КонечныйНомер Цикл
	//	Если НачальныйНомер <> КонечныйНомер Тогда
	//		ПереченьУКЗ.ДобавитьСтроку(""""+Объект.Серия+СтрЗаменить(Строка(НачальныйНомер)," ","")+""",");
	//	Иначе
	//		ПереченьУКЗ.ДобавитьСтроку(""""+Объект.Серия+СтрЗаменить(Строка(НачальныйНомер)," ","")+"""");
	//	КонецЕсли;
	//	НачальныйНомер = НачальныйНомер + 1;
	//КонецЦикла;
	//ПереченьУКЗ.ДобавитьСтроку("]");
	//ПереченьУКЗ.ДобавитьСтроку("}");
	//ПереченьУКЗ.Записать(ИмяФайлаСпискаУКЗ);
	//Запрос.УстановитьИмяФайлаТела(ИмяФайлаСпискаУКЗ);
	//ОтветВыхода = Соединение.ОтправитьДляОбработки(Запрос);
	//
	//ааа = 1;

	
	//Получение списка товаров
	//Заголовки = Новый Соответствие;
	//Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	//Заголовки.Вставить("Host", СсылкаСервера);
	//Заголовки.Вставить("Token", ДанныеПользователя.Token);
	//Запрос = Новый HTTPЗапрос("/catalogs/10090", Заголовки);
	//
	//СтруктураПараметровJSON = Новый Структура;
	//СтруктураПараметровJSON.Вставить("page", 1);
	//ВремменныйФайлДляJSON = ПолучитьИмяВременногоФайла("txt");
	//ТелоЗапроса = Новый ЗаписьJSON;
	//ТелоЗапроса.ОткрытьФайл(ВремменныйФайлДляJSON);
	//ЗаписатьJSON(ТелоЗапроса, СтруктураПараметровJSON);
	//ТелоЗапроса.Закрыть();
	//Запрос.УстановитьИмяФайлаТела(ВремменныйФайлДляJSON);
	//
	//ОтветВыхода = Соединение.ОтправитьДляОбработки(Запрос);
